{
  "profile": {
    "name": {
      "uk": "Ілля Авдосьєв",
      "en": "Illia Avdosiev",
      "pl": "Illia Avdosiev",
      "de": "Illia Avdosiev"
    },
    "age": 20,
    "avatar": "images/avatar/avatar.png",
    "bio": {
      "uk": [
        "Я, Ілля Авдосьєв, мені 20 років. Навчаюсь програмуванню, переважно працюю з C# / .NET. Брав участь у гейм-джемі.",
        "Люблю створювати ігри, експериментувати з логікою, фізикою, UI та системами збереження. Моя ціль — стати професійним розробником ігор або застосунків.",
        "Відкритий до стажування та junior-позицій. Шукаю команду, де зможу зростати, брати відповідальність і доводити задачі до кінця.",
        "Довгостроково хочу створювати власні ігри, що приносять задоволення людям і демонструють креативність українських розробників."
      ],
      "en": [
        "My name is Illia Avdosiev, I'm 20 years old. I'm learning programming, mainly working with C# / .NET and OOP principles. I participated in a game jam.",
        "I love creating games, experimenting with logic, physics, UI and save systems. My goal is to become a professional game or application developer.",
        "Open to internships and junior positions. Looking for a team where I can grow, take responsibility and see tasks through to completion.",
        "Long term, I want to create my own games that bring joy to people and showcase the creativity of Ukrainian developers."
      ],
      "pl": [
        "Nazywam się Illya Avdosyev, mam 20 lat. Uczę się programowania, głównie pracuję z C# / .NET i zasadami OOP. Brałem udział w game jamie.",
        "Lubię tworzyć gry, eksperymentować z logiką, fizyką, interfejsem użytkownika oraz systemami zapisu danych. Moim celem jest zostać profesjonalnym twórcą gier lub aplikacji.",
        "Jestem otwarty na staże i stanowiska juniora. Szukam zespołu, w którym mógłbym się rozwijać, brać odpowiedzialność i doprowadzać zadania do końca.",
        "W dłuższej perspektywie chcę tworzyć własne gry, które przynoszą ludziom radość i pokazują kreatywność ukraińskich twórców."
      ],
      "de": [
        "Ich heiße Illya Avdosyev, bin 20 Jahre alt. Ich studiere Programmierung und arbeite hauptsächlich mit C# / .NET sowie den Prinzipien der OOP. Ich habe an einem Game Jam teilgenommen.",
        "Ich liebe es, Spiele zu entwickeln, mit Logik, Physik, Benutzeroberflächen und Speichersystemen zu experimentieren. Mein Ziel ist es, ein professioneller Spiele- oder App-Entwickler zu werden.",
        "Ich bin offen für Praktika und Junior-Positionen. Ich suche ein Team, in dem ich wachsen, Verantwortung übernehmen und Aufgaben erfolgreich abschließen kann.",
        "Langfristig möchte ich eigene Spiele entwickeln, die Menschen Freude bereiten und die Kreativität ukrainischer Entwickler zeigen."
      ]
    }
  },
  "skills": {
    "languages": {
      "icon": "💻",
      "title": {
        "uk": "Мови програмування",
        "en": "Programming Languages",
        "pl": "Języki programowania",
        "de": "Programmiersprachen"
      },
      "items": [
        "C#",
        ".NET",
        "C++",
        "Python"
      ]
    },
    "tools": {
      "icon": "🎮",
      "title": {
        "uk": "Інструменти",
        "en": "Tools",
        "pl": "Narzędzia",
        "de": "Werkzeuge"
      },
      "items": [
        "Unity",
        "Git",
        "Visual Studio",
        "Visual Studio Code"
      ]
    },
    "principles": {
      "icon": "📚",
      "title": {
        "uk": "Принципи",
        "en": "Principles",
        "pl": "Zasady",
        "de": "Prinzipien"
      },
      "items": [
        "OOP"
      ]
    },
    "other": {
      "icon": "🛠️",
      "title": {
        "uk": "Інше",
        "en": "Other",
        "pl": "Inne",
        "de": "Andere"
      },
      "items": [
        "JSON",
        "Blender"
      ]
    }
  },
  "education": [
    {
      "year": "2022 - 202*",
      "icon": "📅",
      "title": {
        "uk": "Навчання: Віницький Національний Технічний Університет",
        "en": "Education: Vinnytsia National Technical University",
        "pl": "Wykształcenie: Winnicki Narodowy Uniwersytet Techniczny",
        "de": "Ausbildung: Nationale Technische Universität Winniza"
      },
      "description": {
        "uk": "Навчаюся за спеціальністю 121 “Інженерія програмного забезпечення” ,  ступінь бакалавра.",
        "en": "I am studying Software Engineering (specialty 121) , pursuing a Bachelor’s degree.",
        "pl": "Studiuję kierunek Inżynieria oprogramowania (specjalność 121) i zdobywam tytuł licencjata.",
        "de": "Ich studiere Softwaretechnik (Fachrichtung 121) und erwerbe den Bachelorabschluss."
      }
    },
    {
      "year": "2024",
      "icon": "📅",
      "title": {
        "uk": "Курси: Genius Space - Python",
        "en": "Courses: Genius Space - Python",
        "pl": "Kursy: Genius Space - Python",
        "de": "Kurse: Genius Space - Python"
      },
      "description": {
        "uk": "Пройшов повний курс з мови програмування Python на платформі Genius Space, який складався з двох частин і містив 20 уроків загалом.",
        "en": "Completed a full Python programming course on the Genius Space platform, consisting of two parts and a total of 20 lessons.",
        "pl": "Ukończyłem pełny kurs programowania w języku Python na platformie Genius Space, składający się z dwóch części i obejmujący łącznie 20 lekcji.",
        "de": "Ich habe einen vollständigen Python-Programmierkurs auf der Plattform Genius Space abgeschlossen, der aus zwei Teilen bestand und insgesamt 20 Lektionen umfasste."
      }
    },
    {
      "year": "2024",
      "icon": "📅",
      "title": {
        "uk": "Курси: С# від @BloganProgrammingUkraine (Повний курс)",
        "en": "Courses: C# by @BloganProgrammingUkraine (Full Course)",
        "pl": "Kursy: C# od @BloganProgrammingUkraine (Pełny kurs)",
        "de": "Kurse: C# von @BloganProgrammingUkraine (Vollständiger Kurs)"
      },
      "description": {
        "uk": "Під час проходження курсу від @BloganProgrammingUkraine я зміцнив і поглибив свої знання з мови програмування C#.",
        "en": "During the course by @BloganProgrammingUkraine, I strengthened and deepened my knowledge of the C# programming language.",
        "pl": "Podczas kursu prowadzonego przez @BloganProgrammingUkraine utrwaliłem i pogłębiłem swoją wiedzę z języka programowania C#.",
        "de": "Während des Kurses von @BloganProgrammingUkraine habe ich mein Wissen in der Programmiersprache C# gefestigt und vertieft."
      }
    },
    {
      "year": "2024",
      "icon": "📅",
      "title": {
        "uk": "Курси: С++ від @BloganProgrammingUkraine (Повний курс)",
        "en": "Courses: C++ by @BloganProgrammingUkraine (Full Course)",
        "pl": "Kursy: C++ od @BloganProgrammingUkraine (Pełny kurs)",
        "de": "Kurse: C++ von @BloganProgrammingUkraine (Vollständiger Kurs)"
      },
      "description": {
        "uk": "Під час проходження курсу від @BloganProgrammingUkraine я продовжив вивчення мови програмування C++. Завдяки зрозумілим і глибоким поясненням мені вдалося добре засвоїти цю мову.",
        "en": "During the course by @BloganProgrammingUkraine, I continued studying the C++ programming language. Thanks to clear and detailed explanations, I was able to thoroughly learn this language.",
        "pl": "Podczas kursu prowadzonego przez @BloganProgrammingUkraine kontynuowałem naukę języka programowania C++. Dzięki jasnym i szczegółowym wyjaśnieniom udało mi się dobrze opanować ten język.",
        "de": "Während des Kurses von @BloganProgrammingUkraine setzte ich das Lernen der Programmiersprache C++ fort. Dank der klaren und ausführlichen Erklärungen konnte ich diese Sprache gründlich beherrschen."
      }
    },
    {
      "year": "2021 - 202*",
      "icon": "📅",
      "title": {
        "uk": "Самостійне навчання",
        "en": "Self-learning",
        "pl": "Samodzielna nauka",
        "de": "Selbststudium"
      },
      "description": {
        "uk": "Починаючи з 2021 року самостійно вивчаю різні мови програмування — C#, C++, Python, а також платформу .NET та інші технології. Під час навчання поглиблюю знання для розробки майбутніх проектів.",
        "en": "Since 2021, I have been self-studying various programming languages — C#, C++, and Python — as well as the .NET platform and other technologies. During my learning process, I have been deepening my knowledge to develop future projects.",
        "pl": "Od 2021 roku samodzielnie uczę się różnych języków programowania — C#, C++, Python — a także platformy .NET i innych technologii. W trakcie nauki pogłębiam wiedzę, aby tworzyć przyszłe projekty.",
        "de": "Seit 2021 lerne ich selbstständig verschiedene Programmiersprachen — C#, C++, Python — sowie die .NET-Plattform und andere Technologien. Während des Lernprozesses vertiefe ich mein Wissen, um zukünftige Projekte zu entwickeln."
      }
    }
  ],
  "goals": {
    "short": {
      "icon": "🎯",
      "title": {
        "uk": "Короткострокова ціль",
        "en": "Short-term goal"
      },
      "description": {
        "uk": "Отримувати досвід, розвиватися за кожної можливості, прокачувати свої технічні навички та софт-скіли, брати участь у різних проєктах і щодня ставати кращою версією себе.",
        "en": "To gain experience, grow with every opportunity, improve my technical skills and soft skills, participate in various projects, and become a better version of myself every day.",
        "pl": "Zdobywać doświadczenie, rozwijać się przy każdej okazji, doskonalić swoje umiejętności techniczne i miękkie, uczestniczyć w różnych projektach i każdego dnia stawać się lepszą wersją siebie.",
        "de": "Erfahrungen sammeln, jede Gelegenheit zur Weiterentwicklung nutzen, meine technischen Fähigkeiten und Soft Skills verbessern, an verschiedenen Projekten teilnehmen und jeden Tag eine bessere Version meiner selbst werden."
      }
    },
    "long": {
      "icon": "🚀",
      "title": {
        "uk": "Довгострокова ціль",
        "en": "Long-term goal"
      },
      "description": {
        "uk": "Створювати продукти, які приносять користь людям і задоволення від процесу — які подобаються і мені, і користувачам. Хочу працювати в ІТ-компанії, розвиватися в команді та здобувати цінний професійний досвід.",
        "en": "To create products that bring value to people and satisfaction from the process — products that I enjoy building and users love to use. I want to work in an IT company, grow as part of a team, and gain valuable professional experience.",
        "pl": "Tworzyć produkty, które przynoszą ludziom korzyść i satysfakcję z procesu — które podobają się zarówno mnie, jak i użytkownikom. Chcę pracować w firmie IT, rozwijać się w zespole i zdobywać cenne doświadczenie zawodowe.",
        "de": "Produkte schaffen, die den Menschen Nutzen und Freude am Prozess bringen — Produkte, die mir gefallen und von den Nutzern geschätzt werden. Ich möchte in einem IT-Unternehmen arbeiten, mich im Team weiterentwickeln und wertvolle Berufserfahrung sammeln."
      }
    }
  },
  "contacts": {
    "email": "avdosevg@gmail.com",
    "telegram": "@-",
    "github": "https://github.com/s1spa?tab=overview&from=2025-09-01&to=2025-09-17",
    "linkedin": "https://linkedin.com/in/illya-avdosev-845b0932a"
  }
}